<a href="https://colab.research.google.com/github/JarekMaleszyk/data-science-project-sandbox/blob/main/pyspark_test2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [139]:
try:
  import pyspark
except:
  !pip install pyspark

In [140]:
from pyspark.sql import SparkSession

In [141]:
spark = SparkSession.builder.appName('Pratice').getOrCreate()

In [142]:
spark

In [143]:
## read
df_pyspark = spark.read.option('header','true').csv('/content/my_data/simple_data.csv', sep=";", inferSchema=True)

In [144]:
df_pyspark.printSchema()

root
 |-- name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- experience: integer (nullable = true)
 |-- salary: double (nullable = true)
 |-- department: string (nullable = true)

In [145]:
df_pyspark.columns

['name', 'age', 'experience', 'salary', 'department']

In [146]:
print(type(d := df_pyspark.select(['name', 'experience'])))
d.show()

<class 'pyspark.sql.dataframe.DataFrame'>
+-----+----------+
| name|experience|
+-----+----------+
| Kris|         6|
| Adam|         5|
|Sunny|        14|
|  Tom|      NULL|
| John|         3|
| Mark|      NULL|
|  Bob|         7|
|Ellen|         7|
|  Jim|      NULL|
| NULL|        11|
| NULL|        17|
+-----+----------+

In [147]:
df_pyspark['name'] #only Column
df_pyspark.dtypes

[('name', 'string'),
 ('age', 'int'),
 ('experience', 'int'),
 ('salary', 'double'),
 ('department', 'string')]

In [148]:
df_pyspark.describe().show()

+-------+----+-----------------+-----------------+------------------+----------+
|summary|name|              age|       experience|            salary|department|
+-------+----+-----------------+-----------------+------------------+----------+
|  count|   9|               10|                8|                10|        11|
|   mean|NULL|             35.0|             8.75|2373.4710000000005|      NULL|
| stddev|NULL|4.189935029992179|4.803272693844122| 833.8184660204321|      NULL|
|    min|Adam|               28|                3|           1230.99|        HR|
|    max| Tom|               40|               17|           4280.45|        IT|
+-------+----+-----------------+-----------------+------------------+----------+

In [149]:
#add column
df_pyspark = df_pyspark.withColumn('monthly_experience', df_pyspark['experience']*12) # Use withColumn instead of WithColumn
df_pyspark.show()

+-----+----+----------+-------+----------+------------------+
| name| age|experience| salary|department|monthly_experience|
+-----+----+----------+-------+----------+------------------+
| Kris|  31|         6| 2230.3|        IT|                72|
| Adam|  30|         5|2230.89|        HR|                60|
|Sunny|  39|        14|3230.21|        HR|               168|
|  Tom|  28|      NULL|2230.32|        IT|              NULL|
| John|  40|         3|   NULL|  HelpDesk|                36|
| Mark|  36|      NULL|1730.04|        IT|              NULL|
|  Bob|  35|         7|2130.05|        IT|                84|
|Ellen|  34|         7|2230.96|  HelpDesk|                84|
|  Jim|NULL|      NULL|1230.99|        IT|              NULL|
| NULL|  39|        11| 2210.5|        IT|               132|
| NULL|  38|        17|4280.45|        IT|               204|
+-----+----+----------+-------+----------+------------------+

In [150]:
#drop column
df_pyspark = df_pyspark.drop('monthly_experience')
df_pyspark.show()

+-----+----+----------+-------+----------+
| name| age|experience| salary|department|
+-----+----+----------+-------+----------+
| Kris|  31|         6| 2230.3|        IT|
| Adam|  30|         5|2230.89|        HR|
|Sunny|  39|        14|3230.21|        HR|
|  Tom|  28|      NULL|2230.32|        IT|
| John|  40|         3|   NULL|  HelpDesk|
| Mark|  36|      NULL|1730.04|        IT|
|  Bob|  35|         7|2130.05|        IT|
|Ellen|  34|         7|2230.96|  HelpDesk|
|  Jim|NULL|      NULL|1230.99|        IT|
| NULL|  39|        11| 2210.5|        IT|
| NULL|  38|        17|4280.45|        IT|
+-----+----+----------+-------+----------+

In [151]:
#rename column
df_pyspark = df_pyspark.withColumnRenamed('name', 'first_name')
df_pyspark.show()

+----------+----+----------+-------+----------+
|first_name| age|experience| salary|department|
+----------+----+----------+-------+----------+
|      Kris|  31|         6| 2230.3|        IT|
|      Adam|  30|         5|2230.89|        HR|
|     Sunny|  39|        14|3230.21|        HR|
|       Tom|  28|      NULL|2230.32|        IT|
|      John|  40|         3|   NULL|  HelpDesk|
|      Mark|  36|      NULL|1730.04|        IT|
|       Bob|  35|         7|2130.05|        IT|
|     Ellen|  34|         7|2230.96|  HelpDesk|
|       Jim|NULL|      NULL|1230.99|        IT|
|      NULL|  39|        11| 2210.5|        IT|
|      NULL|  38|        17|4280.45|        IT|
+----------+----+----------+-------+----------+

In [152]:
df_pyspark.na.drop(how='any').show() #drop any null value rows

+----------+---+----------+-------+----------+
|first_name|age|experience| salary|department|
+----------+---+----------+-------+----------+
|      Kris| 31|         6| 2230.3|        IT|
|      Adam| 30|         5|2230.89|        HR|
|     Sunny| 39|        14|3230.21|        HR|
|       Bob| 35|         7|2130.05|        IT|
|     Ellen| 34|         7|2230.96|  HelpDesk|
+----------+---+----------+-------+----------+

In [153]:
df_pyspark.na.drop(how='all').show() #drop all null value rows

+----------+----+----------+-------+----------+
|first_name| age|experience| salary|department|
+----------+----+----------+-------+----------+
|      Kris|  31|         6| 2230.3|        IT|
|      Adam|  30|         5|2230.89|        HR|
|     Sunny|  39|        14|3230.21|        HR|
|       Tom|  28|      NULL|2230.32|        IT|
|      John|  40|         3|   NULL|  HelpDesk|
|      Mark|  36|      NULL|1730.04|        IT|
|       Bob|  35|         7|2130.05|        IT|
|     Ellen|  34|         7|2230.96|  HelpDesk|
|       Jim|NULL|      NULL|1230.99|        IT|
|      NULL|  39|        11| 2210.5|        IT|
|      NULL|  38|        17|4280.45|        IT|
+----------+----+----------+-------+----------+

In [154]:
df_pyspark.na.drop(how='any', thresh=3).show() #drop any row with less than 3 non-null values

+----------+----+----------+-------+----------+
|first_name| age|experience| salary|department|
+----------+----+----------+-------+----------+
|      Kris|  31|         6| 2230.3|        IT|
|      Adam|  30|         5|2230.89|        HR|
|     Sunny|  39|        14|3230.21|        HR|
|       Tom|  28|      NULL|2230.32|        IT|
|      John|  40|         3|   NULL|  HelpDesk|
|      Mark|  36|      NULL|1730.04|        IT|
|       Bob|  35|         7|2130.05|        IT|
|     Ellen|  34|         7|2230.96|  HelpDesk|
|       Jim|NULL|      NULL|1230.99|        IT|
|      NULL|  39|        11| 2210.5|        IT|
|      NULL|  38|        17|4280.45|        IT|
+----------+----+----------+-------+----------+

In [155]:
df_pyspark.na.drop(how='any', subset=['experience']).show() #drop any row with null value in experience column

+----------+---+----------+-------+----------+
|first_name|age|experience| salary|department|
+----------+---+----------+-------+----------+
|      Kris| 31|         6| 2230.3|        IT|
|      Adam| 30|         5|2230.89|        HR|
|     Sunny| 39|        14|3230.21|        HR|
|      John| 40|         3|   NULL|  HelpDesk|
|       Bob| 35|         7|2130.05|        IT|
|     Ellen| 34|         7|2230.96|  HelpDesk|
|      NULL| 39|        11| 2210.5|        IT|
|      NULL| 38|        17|4280.45|        IT|
+----------+---+----------+-------+----------+

In [156]:
## filling the missing values
df_pyspark.na.fill(0, ['age', 'experience']).show()

+----------+---+----------+-------+----------+
|first_name|age|experience| salary|department|
+----------+---+----------+-------+----------+
|      Kris| 31|         6| 2230.3|        IT|
|      Adam| 30|         5|2230.89|        HR|
|     Sunny| 39|        14|3230.21|        HR|
|       Tom| 28|         0|2230.32|        IT|
|      John| 40|         3|   NULL|  HelpDesk|
|      Mark| 36|         0|1730.04|        IT|
|       Bob| 35|         7|2130.05|        IT|
|     Ellen| 34|         7|2230.96|  HelpDesk|
|       Jim|  0|         0|1230.99|        IT|
|      NULL| 39|        11| 2210.5|        IT|
|      NULL| 38|        17|4280.45|        IT|
+----------+---+----------+-------+----------+

In [157]:
df_pyspark.na.fill('unknown', ['first_name']).show()

+----------+----+----------+-------+----------+
|first_name| age|experience| salary|department|
+----------+----+----------+-------+----------+
|      Kris|  31|         6| 2230.3|        IT|
|      Adam|  30|         5|2230.89|        HR|
|     Sunny|  39|        14|3230.21|        HR|
|       Tom|  28|      NULL|2230.32|        IT|
|      John|  40|         3|   NULL|  HelpDesk|
|      Mark|  36|      NULL|1730.04|        IT|
|       Bob|  35|         7|2130.05|        IT|
|     Ellen|  34|         7|2230.96|  HelpDesk|
|       Jim|NULL|      NULL|1230.99|        IT|
|   unknown|  39|        11| 2210.5|        IT|
|   unknown|  38|        17|4280.45|        IT|
+----------+----+----------+-------+----------+

In [158]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
    inputCols=['age', 'salary'],
    outputCols=[f'{c}_imputed' for c in ['age', 'salary']]
).setStrategy('median') # mode / mean / median

df_pyspark = imputer.fit(df_pyspark).transform(df_pyspark)
df_pyspark.show()

+----------+----+----------+-------+----------+-----------+--------------+
|first_name| age|experience| salary|department|age_imputed|salary_imputed|
+----------+----+----------+-------+----------+-----------+--------------+
|      Kris|  31|         6| 2230.3|        IT|         31|        2230.3|
|      Adam|  30|         5|2230.89|        HR|         30|       2230.89|
|     Sunny|  39|        14|3230.21|        HR|         39|       3230.21|
|       Tom|  28|      NULL|2230.32|        IT|         28|       2230.32|
|      John|  40|         3|   NULL|  HelpDesk|         40|        2230.3|
|      Mark|  36|      NULL|1730.04|        IT|         36|       1730.04|
|       Bob|  35|         7|2130.05|        IT|         35|       2130.05|
|     Ellen|  34|         7|2230.96|  HelpDesk|         34|       2230.96|
|       Jim|NULL|      NULL|1230.99|        IT|         35|       1230.99|
|      NULL|  39|        11| 2210.5|        IT|         39|        2210.5|
|      NULL|  38|        17|4280.45|        IT|         38|       4280.45|
+----------+----+----------+-------+----------+-----------+--------------+

In [159]:
#filter
df_pyspark.filter('salary_imputed<=2300').show()

+----------+----+----------+-------+----------+-----------+--------------+
|first_name| age|experience| salary|department|age_imputed|salary_imputed|
+----------+----+----------+-------+----------+-----------+--------------+
|      Kris|  31|         6| 2230.3|        IT|         31|        2230.3|
|      Adam|  30|         5|2230.89|        HR|         30|       2230.89|
|       Tom|  28|      NULL|2230.32|        IT|         28|       2230.32|
|      John|  40|         3|   NULL|  HelpDesk|         40|        2230.3|
|      Mark|  36|      NULL|1730.04|        IT|         36|       1730.04|
|       Bob|  35|         7|2130.05|        IT|         35|       2130.05|
|     Ellen|  34|         7|2230.96|  HelpDesk|         34|       2230.96|
|       Jim|NULL|      NULL|1230.99|        IT|         35|       1230.99|
|      NULL|  39|        11| 2210.5|        IT|         39|        2210.5|
+----------+----+----------+-------+----------+-----------+--------------+

In [160]:
df_pyspark.filter('salary_imputed<=2300').select(['first_name', 'age']).filter((df_pyspark['age']<=31) & (df_pyspark['age']>29)).show() # & and

+----------+---+
|first_name|age|
+----------+---+
|      Kris| 31|
|      Adam| 30|
+----------+---+

In [161]:
df_pyspark.filter('salary_imputed<=2300').select(['first_name', 'age']).filter((df_pyspark['age']<=31) & ~(df_pyspark['age']>29)).show() # ~ is not

+----------+---+
|first_name|age|
+----------+---+
|       Tom| 28|
+----------+---+

In [162]:
df_pyspark.filter('salary_imputed<=2300').select(['first_name', 'age']).filter((df_pyspark['age']<=31) | ~(df_pyspark['age']>29)).show() # | or

+----------+---+
|first_name|age|
+----------+---+
|      Kris| 31|
|      Adam| 30|
|       Tom| 28|
+----------+---+

In [194]:
# group by
# https://pyspark.itversity.com/05_basic_transformations/12_aggregate_data_using_groupby.html
from pyspark.sql.functions import sum, avg, count, lit, round
df_pyspark.groupBy(['department']).agg(
    count(lit(1)).alias("cnt"),
    sum('salary').alias('total_salary'),
    round(avg('age'), 2).alias('avg_age') # Apply round to avg('age') and then alias
).show()

+----------+---+------------------+-------+
|department|cnt|      total_salary|avg_age|
+----------+---+------------------+-------+
|        HR|  2|            5461.1|   34.5|
|  HelpDesk|  2|           2230.96|   37.0|
|        IT|  7|16042.650000000001|   34.5|
+----------+---+------------------+-------+

In [191]:
from pyspark.sql.functions import count, lit
df_pyspark.groupBy(['department']).agg(count(lit(1)).alias("cnt")).show()

+----------+---+
|department|cnt|
+----------+---+
|        HR|  2|
|  HelpDesk|  2|
|        IT|  7|
+----------+---+

In [176]:
df_pyspark.agg({'salary':'mean'}).show()

+------------------+
|       avg(salary)|
+------------------+
|2373.4710000000005|
+------------------+